backend/app/Http/Controllers/AuthController.php

    public function me()
    {
        if ($user = auth()->user()) {

            $expenses = auth()->user()->expenses()->get();
---
select * from `expenses` where `expenses`.`user_id` = 1 and `expenses`.`user_id` is not null