backend/app/Http/Controllers/ExpenseController.php

            return response()->json(Errors::ERROR_REGISTERING_EXPENSE->response());
        }

        $expensesData = $this->classifiesReleases(auth()->user()->expenses()->get(), 'Expenses');
---
select * from `expenses` where `expenses`.`user_id` = 1 and `expenses`.`user_id` is not null order by `id` desc limit 1

    public function payExpense(Request $request)
    {
        $expense = Expense::find($request->id);
        $expense->status = 'PAGA';
        $expense->valor = str_replace([',','.'], '', $expense->valor);
        $saved = $expense->save();

        if (!$saved) {
            return Errors::ERROR_PAY_EXPENSE->response();
        }

        $expensesData = $this->classifiesReleases(auth()->user()->expenses()->get(), 'Expenses');
---
select * from `expenses` where `expenses`.`id` = 63 limit 1
select * from `expenses` where `expenses`.`user_id` = 1 and `expenses`.`user_id` is not null