backend/app/Http/Controllers/LogController.php

insert into `logs` (`email`, `timestamp`, `user_agent`, `ip`, `action`, `updated_at`, `created_at`) values ('marcos@gmail.com', '08/09/2023 - 18:55:18', 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Mobile Safari/537.36', '172.19.0.1', 'ME', '2023-09-08 18:55:19', '2023-09-08 18:55:19')
---
    public static function addsLog(string $username, Actions $action): void
    {
        try {
            LogModel::create([
                'email' => $username,
                'timestamp' => date('d/m/Y - H:i:s', $_SERVER['REQUEST_TIME']),
                // 'user_agent' => $request->header('user-agent'),
                'user_agent' => $_SERVER['HTTP_USER_AGENT'],
                //'ip' => $request->ip(),
                'ip' => $_SERVER['REMOTE_ADDR'],
                'action' => $action->getAction(),
            ]);